//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************
//struct SERECT
//{
//	XMFLOAT3	pos;			// ポリゴンの座標
//	XMFLOAT3	rot;			// ポリゴンの回転量
//	float		w, h;			// 幅と高さ
//	int			countAnim;		// アニメーションカウント
//	int			patternAnim;	// アニメーションパターンナンバー
//	int			texNo;			// テクスチャ番号
//};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitStageSerect(void);
void UninitStageSerect(void);
void UpdateStageSerect(void);
void DrawStageSerect(void);


